using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace VIN_LIB
{


    class Enum
    {
        Dictionary<string, string> coun = new Dictionary<string, string>
        {
            {"A-H", "Африка"},
            {"J-R", "Азия"},
            {"S-Z", "Европа"},
            {"1-5", "Северная Америка"},
            {"6-7", "Океания"},
            {"8-9", "Южная Америка"},
        };
        Dictionary<string, string> cod = new Dictionary<string, string>
        {
            {"AA-AH", "ЮАР"},
            {"AJ-AN", "Кот-дИвуар"},
            {"AP-A0", "не используется"},
            {"BA-BE", "Ангола"},
            {"BF-BK", "Кения"},
            {"BL-BR", "Танзания"},
            {"BS-B0", "не используется"},
            {"CA-CE", "Бенин"},
            {"CF-CK", "Мадагаскар"},
            {"CL-CR", "Тунис"},
            {"CS-C0", "не используется"},
            {"DA-DE", "Египет"},
            {"DF-DK", "Марокко"},
            {"DL-DR", "Замбия"},
            {"DS-D)", "не используется"},
            {"EA-EE", "Эфиопия"},
            {"EF-EK", "Мозамбик"},
            {"EL-E0", "не используется"},
            {"FA-FE", "Гана"},
            {"FF-FK", "Нигерия"},
            {"FL-F0", "не используется"},
            {"GA-G0", "не используется"},
            {"HA-H0", "не используется"},
            {"JA-JT", "Япония"},
            {"KA-KE", "Шри Ланка"},
            {"KF-KK", "Израиль"},
            {"KL-KR", "Южная Корея"},
            {"KS-K0", "Казахстан"},
            {"LA-L0", "Китай"},
            {"MA-ME", "Индия"},
            {"MF-MK", "Индонезия"},
            {"ML-MR", "Таиланд"},
            {"MS-M0", "не используется"},
            {"NF-NK", "Пакистан"},
            {"NL-NR", "Турция"},
            {"NT-N0", "не используется"},
            {"PA-PE", "Филиппины"},
            {"PF-PK", "Сингапур"},
            {"PL-PR", "Малайзия"},
            {"PS-P0", "не используется"},
            {"RA-RE", "ОАЭ"},
            {"RF-RK", "Тайвань"},
            {"RL-RR", "Вьетнам"},
            {"RS-R0", "Саудовская Аравия"},
            {"SA-SM", "Великобритания"},
            {"SN-ST", "Германия"},
            {"SU-SZ", "Польша"},
            {"S1-S4", "Латвия"},
            {"TA-TH", "Швейцария"},
            {"TJ-TP", "Чехия"},
            {"TR-TV", "Венгрия"},
            {"TW-T1", "Португалия"},
            {"T2-T0", "не используется"},
            {"UA-UG", "не используется"},
            {"UH-UM", "Дания"},
            {"UN-UT", "Ирландия"},
            {"UU-UZ", "Румыния"},
            {"U1-U4", "не используется"},
            {"U5-U7", "Словакия"},
            {"U8-U0", "не используется"},
            {"VA-VE", "Австрия"},
            {"VF-VR", "Франция"},
            {"VS-VW", "Испания"},
            {"VX-V2", "Сербия"},
            {"V3-V5", "Хорватия"},
            {"V6-V0", "Эстония"},
            {"WA-W0", "Германия"},
            {"XA-XE", "Болгария"},
            {"XF-XK", "Греция"},
            {"XL-XR", "Нидерланды"},
            {"XS-XW", "СССР/СНГ"},
        }
    }
}
